{
  "backend/main.mo": "Motoko canister implementing an e-commerce backend with access control, user profiles, product catalog, carts, and orders. It enforces admin/user permissions and provides CRUD operations for products, profiles, carts, and order lifecycle.",
  "feature_evidence.json": "Structured report listing frontend features implemented around admin claim, transfer, and error handling flows, including affected files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-written summaries of most frontend React files, describing pages, components, hooks, and their roles in the Khan Mobile Zone application.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for the application UI.",
  "frontend/index.html": "HTML entry point that defines the root DOM node and loads the React application bundle.",
  "frontend/src/App.tsx": "Main React application entry that configures TanStack Router routes, wraps the app in a theme provider, and mounts global UI utilities like the toaster.",
  "frontend/src/components/admin/ProductEditor.tsx": "Admin-only React form component for adding or editing products, managing local form state and emitting a typed Product object on save.",
  "frontend/src/components/admin/TransferAdminDialog.tsx": "Modal dialog that lets the current admin transfer admin ownership after typing a confirmation phrase, using a mutation hook and showing error states and loading feedback.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable access-denied screen that displays an admin permission error message with an icon and either custom actions or a default button to navigate home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity that handles authentication state, loading UI, error recovery, and clears cached queries on logout.",
  "frontend/src/components/cart/CartLineItem.tsx": "Renders a single cart item with product info, quantity controls, remove action, and total price, updating the cart via mutation hooks.",
  "frontend/src/components/catalog/ProductCard.tsx": "Product listing card showing image, name, price, brand badge, and an add-to-cart button with stock handling and toast notifications.",
  "frontend/src/components/checkout/DeliveryAddressForm.tsx": "Checkout form for collecting and validating delivery address details, emitting a valid address or null to the parent via a callback.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Radio-based selector for choosing a payment method (cash on delivery or online card) and reporting the selected backend enum value.",
  "frontend/src/components/home/ExplosivePhoneHero.tsx": "Homepage hero section with a canvas-based particle explosion animation that respects reduced-motion preferences and includes navigation CTA content.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, quick navigation links, contact details, and a copyright section with a heart icon and external link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements a responsive site header with logo, navigation links, cart button showing item count, and a mobile slide-out menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout wrapping content with a persistent header and footer and rendering routed pages via an Outlet.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog that forces users to complete their profile by submitting name, email, and phone using a backend mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, handling authentication, admin initialization, and query invalidation on changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Provides mutations to claim or transfer admin privileges and refreshes cached caller role state on success.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the current caller’s user role from the backend using the active actor, defaulting to guest on errors.",
  "frontend/src/hooks/useCart.ts": "Manages cart state with queries and mutations, enriching cart items with product data and exposing helpers for add, update, and count operations.",
  "frontend/src/hooks/useCheckout.ts": "Handles checkout by submitting delivery and payment details to the backend and clearing cart-related caches on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Internet Identity, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks to fetch all products and to add, update, or delete products via the backend actor, with cache invalidation on mutations.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks to fetch and save the caller’s user profile using React Query, handling actor readiness, loading state composition, and cache invalidation.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines extensive CSS variables for light and dark themes, including colors, radius, and base element styles.",
  "frontend/src/lib/catalog.ts": "Contains a helper function that maps numeric brand IDs to human-readable brand names with a fallback to 'Unknown'.",
  "frontend/src/lib/format.ts": "Provides utility functions to format numbers as PKR currency strings and to convert bigint values to numbers.",
  "frontend/src/main.tsx": "Bootstraps the React application by creating the root, configuring the React Query client, and wrapping the app with query and Internet Identity providers.",
  "frontend/src/pages/AboutProfilePage.tsx": "Renders a static about page describing Khan Mobile Zone with profile image, business description, and contact information.",
  "frontend/src/pages/AccessoriesPage.tsx": "Displays accessory products filtered by category, showing category icons, loading skeletons, empty states, and a responsive product grid.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin panel with authentication, role checks, profile setup gating, and full product management (add, edit, delete) plus admin claim/transfer flows.",
  "frontend/src/pages/CartPage.tsx": "Shows the shopping cart with loading and empty states, lists cart items, calculates totals, and provides navigation to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including authentication, profile setup, delivery address, payment selection, order placement, and success confirmation display.",
  "frontend/src/pages/ContactPage.tsx": "Renders a static Contact Us page with phone and email cards, call-to-action buttons, and store visit info using Tailwind UI and lucide icons.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with an animated hero, feature highlights, and a CTA section that navigates users to the mobiles catalog.",
  "frontend/src/pages/MobilesPage.tsx": "Displays a mobiles catalog page that fetches products, supports brand-based filtering (Oppo, Vivo, Infinix), and shows loading skeletons or product cards.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters (including hash routing), persist them in sessionStorage, and manage stored parameters safely.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, custom container settings, extended color palette via CSS variables, animations, and additional plugins.",
  "project_state.json": "Tracks the overall project state, schema version, and implemented features for the Khan Mobile Zone website, including catalog, checkout, branding, and animations."
}